docs/misc.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-02-20 Thu 12:10 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Notes</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Brett Viren" />
<link rel="stylesheet" type="text/css" href="org.css"/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="index.html"> HOME </a>
</div><div id="content">
<h1 class="title">Notes</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org4f990eb">1. Thread safety</a></li>
<li><a href="#orgd2eb489">2. Socket buffering</a></li>
<li><a href="#orgd4904c1">3. Going online with discovery</a></li>
<li><a href="#orgf7c72fd">4. Interoperability</a>
<ul>
<li><a href="#orgc25d94c">4.1. Data extraction/injection</a></li>
<li><a href="#orgf1422b7">4.2. Connecting co-executing WCT graphs</a></li>
<li><a href="#orgff7050b">4.3. Work offloading</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div class="nav">
<ul class="org-ul">
<li><a href="index.html">Main Page</a></li>
<li><a href="install.html">Installation</a></li>
<li><a href="tutorial.html">Tutorials</a></li>
<li><a href="whytos.html">Design documents</a></li>
<li><a href="api.html">API Reference</a></li>
</ul>

</div>

<p>
These notes are for myself no architectural problems and maybe
solutions that I (bv) encountered.  They leave unstated various
assumptions about how some parts of ZIO or other systems work.  They
may be both too terse or too verbose to be useful to others.
</p>

<div id="outline-container-org4f990eb" class="outline-2">
<h2 id="org4f990eb"><span class="section-number-2">1</span> Thread safety</h2>
<div class="outline-text-2" id="text-1">
<p>
Only recent "draft" sockets (CLIENT/SERVER and RADIO/DISH) are
officially thread safe.  All others should not be relied on to work
properly if used from any thread other than the one in which it was
created.  The <code>peer</code> relies on Zyre which uses ROUTER/DEALER but they
are kept to the Zyre actor thread.  However the actor PAIR could be
subject to cross-thread use.  A <code>node</code> creates a <code>peer</code> when it goes
"online" and destroys it when it goes "offline".  Thus, nodes which
will be used between threads must use only thread-safe sockets and go
online/offline in a common thread and must not use <code>peer</code> services in
any other thread.
</p>
</div>
</div>

<div id="outline-container-orgd2eb489" class="outline-2">
<h2 id="orgd2eb489"><span class="section-number-2">2</span> Socket buffering</h2>
<div class="outline-text-2" id="text-2">
<p>
Early termination can cause loss of messages that have been sent out a
socket but not yet received by the remote.  The holder of a socket
must arrange to keep that socket alive in some manner that assures
transmission.
</p>
</div>
</div>

<div id="outline-container-orgd4904c1" class="outline-2">
<h2 id="orgd4904c1"><span class="section-number-2">3</span> Going online with discovery</h2>
<div class="outline-text-2" id="text-3">
<p>
A potential Catch 22 with discovery and ephemeral ports can exist.
Discovery involves broadcasting headers to the network which advertise
the endpoints a peer has or will bind.  Other peers may receive these
advertisements and then connect based on matching peer name and header
key.
</p>

<p>
A peer socket may simultaneously bind and connect to multiple
endpoints.  Furthermore a socket may bind to an endpoint specifying an
<i>ephemeral port</i> (eg, <code>tcp://127.0.0.1:*</code>) in which case the full endpoint
address to advertise may only be constructed after the call to <code>bind()</code>
completes.  (Ignored is the case that the IP address is also wildcard
<code>tcp://*:*</code>.)
</p>

<p>
Thus there is an ordering conundrum that disrupts making discovery,
bind and connect be atomic operations if ephemeral ports are allowed.
And, given discovery is meant to reduce the amount of configuration
information needed, it's reasonable that bind endpoints are specified
as ephemeral.
</p>

<p>
The only reasonable order of operation is then:
</p>

<ol class="org-ol">
<li>bind and resolve ephemeral ports</li>
<li>advertise binds</li>
<li>listen for peer discovery</li>
<li>pattern match on their headers and connect</li>
</ol>

<p>
After advertisement (peer initialization) is complete then the final
two steps are asynchronous.  The peer must decide either to wait for
all expected peers to be discovered (and connections made) or to allow
connections to be completed later.  
</p>
</div>
</div>


<div id="outline-container-orgf7c72fd" class="outline-2">
<h2 id="orgf7c72fd"><span class="section-number-2">4</span> Interoperability</h2>
<div class="outline-text-2" id="text-4">
<p>
One target for application of ZIO is the Wire-Cell Toolkit.  The
features in mind are:
</p>

<ul class="org-ul">
<li>WCT graph data extraction/injection.</li>

<li>Connecting WCT graphs which are co-executing on different computers.</li>

<li>Offload work to non-WCT code such as Python-based GPU access.</li>
</ul>

<p>
The WCT execution context may be single-threaded (<code>Pgraph</code>) or
thread-pool (<code>TbbFlow</code>) based.  The model is that a WCT component is
executed in an external "loop" and is expected to return promptly and
with a Boolean hint saying if output data was produced.  The execution
engine will use that hint to determine if and when the component may
be executed in the future.  Eg, a source component that returns
<code>false</code> is assumed to be depleted and may not enjoy a subsequent
execution.
</p>

<p>
Each of features in the execution context reality are considered in
the following subsections but they all share a risk of deadlock due to
a common pattern: imposed synchronicity on a partially asynchronous
system.  What this means is that if system <b>A</b> has \(N_a\) components of
which at most \(T_a\) may execute concurrently and system <b>B</b> imposes
synchronization on \(N > T_a\) of system <b>A</b> components then system <b>A</b>
(and likely system <b>B</b>) may deadlock.  If a system <b>may</b> deadlock then
eventually it will.
</p>

<p>
ZIO may impose synchronization in one or more of the following ways:
</p>

<ul class="org-ul">
<li>A ZeroMQ socket has a buffer with a high-water-mark (HWM).  When
reached the socket will either block any new messages from entering
or it will drop those new messages.  The block causes
synchronization and the drop mode (in WCT application) is usually
not acceptable.  HWM are limited by system memory and default to
1000 messages.</li>

<li>ZIO data flow protocol uses credit-based flow control.  This is like
a HWM that is shared by both endpoints.  The number of credits to
safely use is limited by the minimum of the available memory of both
endpoints.</li>

<li>ZIO data flow is initiated with a semi-synchronous two-way exchange
of <b>BOT</b> messages.  The ZIO flow protocol demands the client send
and receive a <b>BOT</b> and the server receive and send a <b>BOT</b> before
transmission of payload begins.  Both ends can do other things while
waiting for the <b>BOT</b> exchange to complete but when one end is a WCT
component, it can not relinquish execution without either risking a
busy loop or never executing again.</li>
</ul>
</div>




<div id="outline-container-orgc25d94c" class="outline-3">
<h3 id="orgc25d94c"><span class="section-number-3">4.1</span> Data extraction/injection</h3>
<div class="outline-text-3" id="text-4-1">
<p>
Mixing ZIO and WCT thus faces a risk of deadlock.  Consider a simple
case where two WCT components are ZIO nodes each with a port
communicating with the ZIO <a href="flow.html">flow</a> protocol and where the
server needs to collect all <b>BOT</b> messages before responding with its
own <b>BOT</b> messages.  This case may arise in a server that writes to a
stream-based file format (eg Ogg) where a header block must be written
to file for each flow prior to writing any payload.  If the
single-thread WCT graph execution engine is used then any wait on a
<code>recv()</code> following a <code>send()</code> of a <b>BOT</b> will deadlock.  When the
thread-pool engine is used, if there are more flow senders than
threads the operation will also deadlock.  
</p>

<p>
As of now, a natural maximum number of threads for <code>TbbFlow</code> for PDSP
is 6, one per APA.  When the sigproc and simulation refactoring is
complete, this number may be multiplied by the number of planes per
APA that can be treated separately (3 or 4).  In DUNE, instead of 6
APA there are 150.  When run in the context of a "grid" job, we may
use more threads than cores allocated by the batch job but we must not
use more than that many cores.  TBB (to my knowledge) does not have a
way to limit CPU% other than limiting number of threads.  Allocating 6
or 18 or 600 cores progressively reduces the slots available to
receive the job.  Thus to allocate enough threads to avoid deadlock
will practically prohibit the job from running.
</p>

<p>
Thus, ZIO and WCT can not, in general, interoperate in a way that
causes synchronization across WCT components.
</p>

<p>
One weak workaround is for the flow receiver to respond to <b>BOT</b>
immediately and to buffer subsequent <b>DAT</b> payload until all <b>BOT</b>
messages have been received.  Then, per flow headers can be written,
buffered <b>DAT</b> can be written and from then on subsequent <b>DAT</b>
streamed to file.  This "catchup" phase following the final <b>BOT</b> will
delay servicing fresh flow messages.  If that delay is long enough to
eat up all credit the WCT flow senders will temporarily wait.  If all
flow senders do not send and receive their <b>BOT</b> before others eat up
credit then deadlock occurs.
</p>

<p>
Another workaround is to dispense with ZIO flow protocol and use
spray-and-pray PUB/SUB or PUSH/PULL <b>and</b> receiver buffering to get an
initial message from each stream prior to writing its payload.  This
is less weak but still has weakness.  Consider some components are
faster than others.  They can exhaust the HWMs of their sockets and
either block on send (PUSH) or drop messages (PUB).  The first case
can lead to deadlock in the same way as the credit exhaustion or the
original cross-component sync can.  As each sender hits HWM and waits
it monopolizes a thread from the pool.  If enough senders reach this
state before all can send <b>BOT</b> then deadlock.  The second case of
dropping data won't lead to deadlock.  But, for a file I/O
application, its not acceptable either.
</p>

<p>
One strong workaround is to pre-configure the receiver with the
information needed for the file stream "headers".  At some level this
preconfiguration is required in any case as the receiver needs to know
how many streams to expect.  This allows the server not to require
synchronization across all clients for the <b>BOT</b> exchange.
</p>

<p>
A rather kludgey workaround comes from recognizing that this need to
get "introduced" to all streams before writing any payload data is the
source of the problem.  Using or coercing a file format to not require
this sync point erases the problem.  For example, writing headers and
payload to different files and then post-processing these two into one
file may solve the problem, at some additional I/O expense.  For
example, it may be possible to simply <code>cat</code> these two files (eg, if
they are in Ogg format).  Identifying a ROOT <code>TTree</code> to each stream
may allow initiating a new tree when its associated <b>BOT</b> first
arrives.
</p>

<p>
Another strong workaround is to build the WCT graph to provide the
needed synchronization.  The downstream component of the sync point
can then implement a single-threaded file I/O context directly.  This
is of course possible but WCT design causes some development
annoyances: WCT graph edges, ports and thus nodes are strongly typed.
One does not connect up WCT graph nodes willy-nilly.  It takes effort
to develop a node with any novel set of port types and number.  For
example, <code>IFaninNode</code> is templated on a single input type, its
port-multiplicity number and a single output type.  It can not handle
accepting mixed input of, say, an <code>IDepo</code> and an <code>IFrame</code> as needed to
save intermediates of a simulation.  On the other hand, an <code>IJoinNode</code>
may accept mixed input types as specific by a fixed tuple.  So, for
example, one might output data to file from a WCT PDSP simulation with
a 6-way frame fanin which feeds to a join accepting <code>&lt;IFrame,IDepo&gt;</code>
tuple.  So far, no mixed-type <code>IJoinNodes</code> have been used in WCT.
</p>
</div>
</div>



<div id="outline-container-orgf1422b7" class="outline-3">
<h3 id="orgf1422b7"><span class="section-number-3">4.2</span> Connecting co-executing WCT graphs</h3>
<div class="outline-text-3" id="text-4-2">
<p>
The deadlock risk here is essentially the same as the one described
for extraction/injection above.  It can be less obviously expressed
and in some cases two WCT graphs may co-execute without risk of
deadlock.  
</p>

<p>
Consider two graphs connected by a single pair of WCT/ZIO components
with a one-way data flow.  Even if both graphs use the single-threaded
engine, no deadlock will occur.  The upstream node is a simple sink of
data from its WCT graph and the downstream node a simple source.
</p>

<p>
If the two graphs connect via a two pairs of parallel ZIO flow,
deadlock may occur.  If the downstream graph structure directly or
<b>indirectly</b> causes synchronization across the two nodes receiving
flow and the upstream graph uses only a single thread, deadlock will
occur.
</p>

<p>
The connectivity between the two graphs can be increased but as long
as synchronicity is required, deadlock is a risk.
</p>
</div>
</div>

<div id="outline-container-orgff7050b" class="outline-3">
<h3 id="orgff7050b"><span class="section-number-3">4.3</span> Work offloading</h3>
<div class="outline-text-3" id="text-4-3">
<p>
The model here is that a WCT graph has a component which performs a
task by giving it to an "external" element instead of performing it
directly.  For example, a WCT 2D deconvolution component may send its
input data across ZIO to an implementation based on PyTorch which uses
a GPU to accelerate the work.  When complete the result is sent back
to the WCT component.
</p>

<p>
This uses a fully synchronous protocol between the WCT component and
ZIO.  The larger WCT graph will simply wait as if the WCT component
was executing directly.  If the "external" element receives input
asynchronously from multiple WCT components (as it likely should for
performance reasons) it must not attempt to synchronize across them or
the same type of deadlock may occur.
</p>
</div>
</div>
</div>
</div>
</body>
</html>
